Управление_по_целям_и_KPI/src/Documents/KPI_ПриказОСнятииСДолжности/KPI_ПриказОСнятииСДолжности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>KPI_ПриказОСнятииСДолжности</name>
  <registerRecords>InformationRegister.KPI_КадроваяИсторияСотрудников</registerRecords>
  <registerRecords>InformationRegister.KPI_ПлановыеНачисления</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.KPI_Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_по_целям_и_KPI/src/InformationRegisters/KPI_СтруктураКомпании/KPI_СтруктураКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>KPI_СтруктураКомпании</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.KPI_Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СкрытьВСтруктуре</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтруктураУдалена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>СтруктураКомпании</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_по_целям_и_KPI/src/Documents/KPI_ПриказОСнятииСДолжности/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ОбработкаУдаленияПроведения(Отказ);
	
	Для каждого Строка Из Сотрудники Цикл
		
		//Проверка на занятость должности сотрудником
		Если Не ЗначениеЗаполнено(Строка.Сотрудник) Тогда      			
			Сообщить("Сотрудник " + Строка.Сотрудник + " не занимает должность """ + Строка.Сотрудник.СтруктураКомпании.Должность + """ на данную дату");
			УдалитьПроведение = Истина;			
		Иначе
			//Проверка на возможность проведения задним числом
			Если НачалоДня(Дата) >= НачалоДня(ТекущаяДата()) Или KPI_ОбщегоНазначенияСервер.ПроверкаНаВозможностьПроведенияЗаднимЧислом(Строка.Сотрудник.СтруктураКомпании, Дата, Истина) Тогда
				УдалитьПроведение = Ложь;
			Иначе
				УдалитьПроведение = Истина;
				Сообщить("Проведение задним числом невозможно, т.к. существуют документы снятия с должности """ + Строка.Сотрудник.СтруктураКомпании.Должность + """ на более позднюю дату (Строка №" + Строка.НомерСтроки + ")");
			КонецЕсли;
		КонецЕсли;	
		
		//Делаем запись об увольнении сотрудника
		Запись = РегистрыСведений.KPI_СтруктураКомпании.СоздатьМенеджерЗаписи();
		Запись.СтруктураКомпании = Строка.Сотрудник.СтруктураКомпании;
		Запись.Период            = Дата-1;
		Запись.Прочитать();
		Запись.СтруктураКомпании = Строка.Сотрудник.СтруктураКомпании;
		Запись.Уволен            = Истина;
		Запись.Сотрудник         = Строка.Сотрудник;
		Запись.Период            = Дата-1;
		Запись.Записать();  
		
		//Делаем запись о пустом структурном подразделении
		Запись = РегистрыСведений.KPI_СтруктураКомпании.СоздатьМенеджерЗаписи();
		Запись.СтруктураКомпании = Строка.Сотрудник.СтруктураКомпании;
		Запись.Период            = Дата;
		Запись.Уволен            = Ложь;
		Запись.Период            = Дата;
		Запись.Записать();   	
		
	КонецЦикла;	
	
	Если УдалитьПроведение Тогда
		ЭтотОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Для каждого Строка Из Сотрудники Цикл
		
		//Удаляем записи об увольнении сотрудника
		Запись = РегистрыСведений.KPI_СтруктураКомпании.СоздатьМенеджерЗаписи();
		Запись.СтруктураКомпании = Строка.Сотрудник.СтруктураКомпании;
		Запись.Период = Дата-1;
		Запись.Прочитать();
		Запись.Удалить();  
		
		//Удаляем записи о пустом структурном подразделении
		Запись = РегистрыСведений.KPI_СтруктураКомпании.СоздатьМенеджерЗаписи();
		Запись.СтруктураКомпании = Строка.Сотрудник.СтруктураКомпании;
		Запись.Период = Дата;
		Запись.Прочитать();
		Запись.Удалить();
		
	КонецЦикла;		
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
		Если ДанныеЗаполнения.Свойство("Сотрудник") Тогда
			нСтр = Сотрудники.Добавить();
			нСтр.Сотрудник = ДанныеЗаполнения.Сотрудник;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ПараметрыСеанса.KPI_ТекущийСотрудник.СтруктураКомпании;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры
